# CannotUnlockFamilyTemplate Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..CannotUnlockFamilyTemplate Property
BuiltInFailures..::..FamilyFailures Class See Also
---
Can't unlock alignments from Family Template.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotUnlockFamilyTemplate { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotUnlockFamilyTemplate As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotUnlockFamilyTemplate {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace